## BASIC of SQLITE: Create a database and table using SQLite, insert and load data into the table, delete, edit and update database

In [38]:
import sqlite3
import pandas as pd

In [86]:
# Create a connection object
conn = sqlite3.connect("auto.db")

# Create a cursor object
db= conn.cursor()

In [3]:
#Create table
db.execute("create table automobile (brand_name text, model_name text,  release_year integer, city text, country text)")

OperationalError: table automobile already exists

In [4]:
# Creat list
list0 = [
("Toyota", "Corolla", 1966, "Toyota", "Japan"),
("Ford", "F-Series", 1948, "Dearborn", "USA"),
("Honda", "Civic", 1972, "Tokyo", "Japan"),
("Chevrolet", "Impala", 1958, "Detroit", "USA"),
("Nissan", "Altima", 2020, "Yokohama", "Japan"),
("Volkswagen", "Beetle", 1938, "Wolfsburg", "Germany"),
("BMW", "3 Series", 1975, "Munich", "Germany"),
("Mercedes-Benz", "S-Class", 1954, "Stuttgart", "Germany"),
("Audi", "A4", 1994, "Ingolstadt", "Germany"),
("Porsche", "911", 1963, "Stuttgart", "Germany")
]

#### Inseert data into database table

In [5]:
# Insert into table
db.executemany("INSERT INTO automobile (brand_name, model_name,  release_year, city, country) VALUES (?, ?, ?, ?, ?)", list0)
conn.commit()

In [3]:
#print a specific table
for row in db.execute("SELECT * FROM automobile"):
	print(row)

('Toyota', 'Corolla', 1966, 'Toyota', 'Japan')
('Ford', 'F-Series', 1948, 'Dearborn', 'USA')
('Honda', 'Civic', 1972, 'Tokyo', 'Japan')
('Chevrolet', 'Impala', 1958, 'Detroit', 'USA')
('Nissan', 'Altima', 2020, 'Yokohama', 'Japan')
('Volkswagen', 'Beetle', 1938, 'Wolfsburg', 'Germany')
('BMW', '3 Series', 1975, 'Munich', 'Germany')
('Mercedes-Benz', 'S-Class', 1954, 'Stuttgart', 'Germany')
('Audi', 'A4', 1994, 'Ingolstadt', 'Germany')
('Porsche', '911', 1963, 'Stuttgart', 'Germany')

In [4]:
#print specific rows
db.execute("select * from automobile WHERE country=:j", {"j": "USA"})
auto_search =db.fetchall()
print(auto_search)

print("____________________________________________________________________________________________________")

[('Ford', 'F-Series', 1948, 'Dearborn', 'USA'), ('Chevrolet', 'Impala', 1958, 'Detroit', 'USA')]
____________________________________________________________________________________________________

#### Create a new table called new_auto in the auto database

In [12]:
#create a table call new_auto
db.execute("create table new_auto (new_brand text, new_model text,  year integer, city text, country text)")

OperationalError: table new_auto already exists

In [14]:
# create list
list1=[
    ("Toyota", "Corolla", 2020, "Toyota City", "Asia"),
    ("Ford", "F-Series", 2023, "Dearborn Michigan", "USA"),
    ("Porsche", "911", 1963, "Stuttgart", "Germany")
]

In [18]:
# Insert list into table
db.executemany("INSERT INTO new_auto (new_brand, new_model,  year, city, country) VALUES (?, ?, ?, ?, ?)", list1)
conn.commit()

In [5]:
for a in db.execute("SELECT * FROM new_auto"):
    print(a)

('Toyota', 'Corolla', 2020, 'Toyota City', 'Asia')
('Ford', 'F-Series', 2023, 'Dearborn Michigan', 'USA')
('Toyota', 'Corolla', 2020, 'Toyota City', 'Asia')
('Ford', 'F-Series', 2023, 'Dearborn Michigan', 'USA')
('Porsche', '911', 1963, 'Stuttgart', 'Germany')
('Toyota', 'Corolla', 2020, 'Toyota City', 'Asia')
('Ford', 'F-Series', 2023, 'Dearborn Michigan', 'USA')
('Porsche', '911', 1963, 'Stuttgart', 'Germany')
('Toyota', 'Corolla', 2020, 'Toyota City', 'Asia')
('Ford', 'F-Series', 2023, 'Dearborn Michigan', 'USA')
('Porsche', '911', 1963, 'Stuttgart', 'Germany')
('Toyota', 'Corolla', 2020, 'Toyota City', 'Asia')
('Ford', 'F-Series', 2023, 'Dearborn Michigan', 'USA')
('Porsche', '911', 1963, 'Stuttgart', 'Germany')
('Mercedes-Benz', 'S-Class', 1954, 'Stuttgart', 'Germany')
('Mercedes-Benz', 'S-Class', 1954, 'Stuttgart', 'Germany')
('Mercedes-Benz', 'S-Class', 1954, 'Stuttgart', 'Germany')

In [6]:
db.execute("SELECT * FROM new_auto WHERE country=:g", {"g": "Germany"})
new_auto_search = db.fetchall()
new_auto_search

[('Porsche', '911', 1963, 'Stuttgart', 'Germany'),
 ('Porsche', '911', 1963, 'Stuttgart', 'Germany'),
 ('Porsche', '911', 1963, 'Stuttgart', 'Germany'),
 ('Porsche', '911', 1963, 'Stuttgart', 'Germany'),
 ('Mercedes-Benz', 'S-Class', 1954, 'Stuttgart', 'Germany'),
 ('Mercedes-Benz', 'S-Class', 1954, 'Stuttgart', 'Germany'),
 ('Mercedes-Benz', 'S-Class', 1954, 'Stuttgart', 'Germany')]

In [67]:
# Insert into table
db.execute("INSERT INTO new_auto (new_brand, new_model,  year, city, country) VALUES ('Mercedes-Benz', 'S-Class', 1954, 'Stuttgart', 'Germany')")
conn.commit()

In [7]:
#Select 3 specific columns from the table
def auto():
    db.execute("SELECT brand_name, release_year, country FROM automobile")
    search = db.fetchall()
    for i in search:
        print(""" Brand_name: {0}\n Release_date: {1}\n Country: {0}\n""".format(i[0], i[1], i[2]))
        print("_"*25)
auto()

 Brand_name: Toyota
 Release_date: 1966
 Country: Toyota

_________________________
 Brand_name: Ford
 Release_date: 1948
 Country: Ford

_________________________
 Brand_name: Honda
 Release_date: 1972
 Country: Honda

_________________________
 Brand_name: Chevrolet
 Release_date: 1958
 Country: Chevrolet

_________________________
 Brand_name: Nissan
 Release_date: 2020
 Country: Nissan

_________________________
 Brand_name: Volkswagen
 Release_date: 1938
 Country: Volkswagen

_________________________
 Brand_name: BMW
 Release_date: 1975
 Country: BMW

_________________________
 Brand_name: Mercedes-Benz
 Release_date: 1954
 Country: Mercedes-Benz

_________________________
 Brand_name: Audi
 Release_date: 1994
 Country: Audi

_________________________
 Brand_name: Porsche
 Release_date: 1963
 Country: Porsche

_________________________

In [8]:
# Select all Germany rows in the table
db.execute("SELECT * FROM automobile WHERE country=='Germany'")
search1 = db.fetchall()
for i in search1:
    print(""" brand_name: {0}\n model_name: {1}\n  release_year: {2}\n city: {3}\n country: {4}\n""".format(i[0],i[1],i[2],i[3],i[4]))
    print("_"*30)

 brand_name: Volkswagen
 model_name: Beetle
  release_year: 1938
 city: Wolfsburg
 country: Germany

______________________________
 brand_name: BMW
 model_name: 3 Series
  release_year: 1975
 city: Munich
 country: Germany

______________________________
 brand_name: Mercedes-Benz
 model_name: S-Class
  release_year: 1954
 city: Stuttgart
 country: Germany

______________________________
 brand_name: Audi
 model_name: A4
  release_year: 1994
 city: Ingolstadt
 country: Germany

______________________________
 brand_name: Porsche
 model_name: 911
  release_year: 1963
 city: Stuttgart
 country: Germany

______________________________

#### Updating the database

In [29]:
# Update table
db.execute("UPDATE automobile SET release_year=2022 WHERE brand_name=:v", {"v": "Volkswagen"})
conn.commit()

In [30]:
for r in db.execute("SELECT * FROM automobile"):
    print(r)

('Toyota', 'Corolla', 1966, 'Toyota', 'Japan')
('Ford', 'F-Series', 1948, 'Dearborn', 'USA')
('Honda', 'Civic', 1972, 'Tokyo', 'Japan')
('Chevrolet', 'Impala', 1958, 'Detroit', 'USA')
('Nissan', 'Altima', 2020, 'Yokohama', 'Japan')
('Volkswagen', 'Beetle', 2022, 'Wolfsburg', 'Germany')
('BMW', '3 Series', 1975, 'Munich', 'Germany')
('Mercedes-Benz', 'S-Class', 1954, 'Stuttgart', 'Germany')
('Audi', 'A4', 1994, 'Ingolstadt', 'Germany')
('Porsche', '911', 1963, 'Stuttgart', 'Germany')

In [31]:
db.execute("UPDATE automobile SET release_year=2023 WHERE brand_name=='Volkswagen'")
conn.commit()

In [37]:
for r in db.execute("SELECT * FROM automobile"):
    print(r)

('Toyota', 'Corolla', 1966, 'Toyota', 'Japan')
('Ford', 'F-Series', 1948, 'Dearborn', 'USA')
('Honda', 'Civic', 1972, 'Tokyo', 'Japan')
('Chevrolet', 'Impala', 1958, 'Detroit', 'USA')
('Nissan', 'Altima', 2020, 'Yokohama', 'Japan')
('Volkswagen', 'Beetle', 2023, 'Wolfsburg', 'Germany')
('BMW', '3 Series', 1975, 'Munich', 'Germany')
('Mercedes-Benz', 'S-Class', 1954, 'Stuttgart', 'Germany')
('Audi', 'A4', 1994, 'Ingolstadt', 'Germany')
('Porsche', '911', 1963, 'Stuttgart', 'Germany')

#### Basic Manipulation

In [103]:
for row in db.execute("SELECT release_year, brand_name, model_name FROM automobile ORDER BY release_year DESC"):
    #df = pd.DataFrame(row)
    print(row)

(2023, 'Volkswagen', 'Beetle')
(2020, 'Nissan', 'Altima')
(1994, 'Audi', 'A4')
(1975, 'BMW', '3 Series')
(1972, 'Honda', 'Civic')
(1966, 'Toyota', 'Corolla')
(1963, 'Porsche', '911')
(1958, 'Chevrolet', 'Impala')
(1954, 'Mercedes-Benz', 'S-Class')
(1948, 'Ford', 'F-Series')

#### Convert sqlite table to pandas dataframe

In [51]:
#Convert sqlite table to pandas dataframe
def load():
    db.execute("SELECT * FROM automobile")
    rows= db.fetchall()
    return rows
    
df=pd.DataFrame(load(),columns=["brand_name", "model_name",  "release_year", "city", "country"])
df.head(2)

  brand_name model_name  release_year      city country
0     Toyota    Corolla          1966    Toyota   Japan
1       Ford   F-Series          1948  Dearborn     USA

#### Delete a row from database table new_auto

In [61]:
# Delete row from the table 
db.execute("DELETE FROM new_auto WHERE country=='Germany'")
conn.commit()

In [62]:
# Show table 
for a in db.execute("SELECT * FROM new_auto"):
    print(a)

('Toyota', 'Corolla', 2020, 'Toyota City', 'Asia')
('Ford', 'F-Series', 2023, 'Dearborn Michigan', 'USA')
('Toyota', 'Corolla', 2020, 'Toyota City', 'Asia')
('Ford', 'F-Series', 2023, 'Dearborn Michigan', 'USA')
('Toyota', 'Corolla', 2020, 'Toyota City', 'Asia')
('Ford', 'F-Series', 2023, 'Dearborn Michigan', 'USA')
('Toyota', 'Corolla', 2020, 'Toyota City', 'Asia')
('Ford', 'F-Series', 2023, 'Dearborn Michigan', 'USA')
('Toyota', 'Corolla', 2020, 'Toyota City', 'Asia')
('Ford', 'F-Series', 2023, 'Dearborn Michigan', 'USA')

In [69]:
db.close()
conn.close()

#### Upload CSV file to database

In [70]:
# load csv data file
df = pd.read_csv('C:/Users/peace/dash/sqlite/score.csv')

In [80]:
# remove empty spaces
df.columns = df.columns.str.strip()
df.head(1)

  best_selling_car    model  year  score
0           Toyota  Corolla  1966  39000

In [79]:
conn = sqlite3.connect("auto.db")
db = conn.cursor()
# now upload the csv file to the database. CONDITION: if the file exist "fail" -either "replace" or "append" orther options
df.to_sql('score', conn, if_exists='fail')
conn.commit()

for row in db.execute("SELECT * FROM score"):
    print(row)

(0, 'Toyota', 'Corolla', 1966, 39000)
(1, 'Ford', 'F-Series', 1948, 22000)
(2, 'Honda', 'Civic', 1972, 41000)
(3, 'Chevrolet', 'Impala', 1958, 43000)
(4, 'Nissan', 'Altima', 2020, 28000)
(5, 'Volkswagen', 'Beetle', 2023, 55000)
(6, 'BMW', '3 Series', 1975, 40000)
(7, 'Mercedes-Benz', 'S-Class', 1954, 39500)
(8, 'Audi', 'A4', 1994, 21000)
(9, 'Porsche', '911', 1963, 19000)

In [81]:
db.close()
conn.close()